#include <iostream>
#include <cmath>
int main() 
{
//Boolean27. Дано числа x, y.
    //Перевірити істинність висловлювання: 
    //«Точка з координатами (x, y) лежить в другій або третій координатній чверті»
    int x, y; // декларація цілих змінних
    // введення данних
 std::cout << "Введіть координати x і y: ";
    // підрахунок
    std::cin >> x >> y;
    
    if (x > 0 && y < 0) {
         // виведення результату
        std::cout << "Точка лежить в третій координатній чверті." << std::endl;
    } else {
        std::cout << "Точка не лежить в третій координатній чверті." << std::endl;
    }
    
return 0;
}